#include <iostream>
using namespace std;

int main(){
    int n;
    cin>>n;
    for(int i = 0; i < n; i++){
        int x;
        cin>>x;
        for(int j = 1; j <= x/2; j++){
            if(x%j == 0) cout<<j<<" ";
        }
        cout<<x<<endl;
    }
}

/*সমস্যার বিবরণ
একটি সংখ্যার সব গুণনীয়ক (ভাজক) বের করতে হবে।

ইনপুট
প্রথম লাইনে থাকবে টেস্ট কেসের সংখ্যা (t <= 10) পরবর্তী t সংখ্যক লাইনে একটি করে পূর্ণসংখ্যা n থাকবে, যেখানে 1<=n<=100000

আউটপুট:

প্রতিটি কেসের জন্য একটি করে লাইন প্রিন্ট করতে হবে, শুরুতে কেস নম্বর দিতে হবে। এরপর nএর সব গুণনীয়ক ছোটো থেকে বড়ো ক্রমানুসারে প্রিন্ট করতে হবে। প্রতিটি গুণনীয়ক শুধু একবার প্রিন্ট করতে হবে। গুণনীয়কগুলোকে শুধু একটি স্পেস দিয়ে আলাদা করতে হবে। লাইনের শেষে কোনো অতিরিক্ত স্পেস থাকবে না।

নমুনা ইনপুট আউটপুট
নমুনা #১
ইনপুট
3
6
15
23
আউটপুট
Case 1: 1 2 3 6
Case 2: 1 3 5 15
Case 3: 1 23*/